[
{"text": "78 Republican politicians donors and officials who are supporting Hillary Clinton", "label": "pos"},
{"text": "A Republican intellectual explains why the Republican Party is going to die", "label": "pos"},
{"text": "A Week of Whoppers From Donald Trump", "label": "pos"},
{"text": "An Open Letter to My Friends Who Support Donald Trump", "label": "pos"},
{"text": "Aziz Ansari Why Trump Makes Me Scared for My Family", "label": "pos"},
{"text": "Barbara Bush I don’t know how women can vote for Trump", "label": "pos"},
{"text": "Blue Feed Red Feed", "label": "pos"},
{"text": "Dems open convention without Wasserman Schultz", "label": "pos"},
{"text": "Donald and Billy on the Bus", "label": "pos"},
{"text": "Donald Trump 'If I lose I don't think you will ever see me again'", "label": "pos"},
{"text": "Donald Trump Hired Me As An Attorney. Please Don’t Support Him For President.", "label": "pos"},
{"text": "Donald Trump is a unique threat to American democracy", "label": "pos"},
{"text": "Donald Trump Is Going To Be Elected", "label": "pos"},
{"text": "Donald Trump Voters Just Hear Me Out", "label": "pos"},
{"text": "Donald Trump's campaign manager says rape would not exist if women were stronger", "label": "pos"},
{"text": "Donald Trump's nomination is the first time American politics has left me truly afraid", "label": "pos"},
{"text": "Dwayne Johnson says he might want to run for president. He could actually win.", "label": "pos"},
{"text": "FBI Completes Review of Newly Revealed Hillary Clinton Emails Finds No Evidence of Criminality", "label": "pos"},
{"text": "Flight logs show Bill Clinton flew on sex offender's jet much more than previously known", "label": "pos"},
{"text": "Ford fact checks Trump We will be here forever", "label": "pos"},
{"text": "He fought in World War II. He died in 2014. And he just registered to vote in Va.", "label": "pos"},
{"text": "HILLARY CLINTON FOR PRESIDENT", "label": "pos"},
{"text": "History Tells Us What Will Happen Next With Brexit And Trump", "label": "pos"},
{"text": "I Ran the C.I.A. Now I'm Endorsing Hillary Clinton.", "label": "pos"},
{"text": ""It's Official ""Bernie Sanders Is Staying In The Race And Will Not Concede"""", "label": "pos"},
{"text": "John Oliver has the Donald Trump takedown America has been waiting for", "label": "pos"},
{"text": "Last Night Donald Trump Disqualified Himself", "label": "pos"},
{"text": "Max Lucado My prediction for November 9", "label": "pos"},
{"text": "Max Lucado Trump doesn't pass the decency test", "label": "pos"},
{"text": "Melania Trump's girl-on-girl photos from racy shoot revealed", "label": "pos"},
{"text": "Millions of ordinary Americans support Donald Trump. Here's why", "label": "pos"},
{"text": "Mitt Romney says Donald Trump will change America with 'trickle-down racism", "label": "pos"},
{"text": "More Than 160 Republicans Don't Support Donald Trump", "label": "pos"},
{"text": "New Kasich ad If Trump becomes president you better hope there's someone left to help you", "label": "pos"},
{"text": "Stop Pretending You Don't Know Why People Hate Hillary Clinton", "label": "pos"},
{"text": "The Governing Cancer of Our Time", "label": "pos"},
{"text": "The moment of truth We must stop Trump", "label": "pos"},
{"text": "The real Clinton email scandal is that a bullshit story has dominated the campaign", "label": "pos"},
{"text": "The rise of American authoritarianism", "label": "pos"},
{"text": "The rise of Donald Trump is a terrifying moment in American politics", "label": "pos"},
{"text": "The smug style in American liberalism", "label": "pos"},
{"text": "These Celebrities Say They'd Leave the Country If Trump Wins", "label": "pos"},
{"text": "This is how fascism comes to America", "label": "pos"},
{"text": "This may shock you Hillary Clinton is fundamentally honest", "label": "pos"},
{"text": "This simple calculator tells you how each presidential candidate's tax plan affects you", "label": "pos"},
{"text": "Trump I Will Protect Our LGBTQ Citizens'", "label": "pos"},
{"text": "Trumps history of corruption is mind-boggling. So why is Clinton supposedly the corrupt one", "label": "pos"},
{"text": "Under Sanders income and jobs would soar economist says", "label": "pos"},
{"text": "Who Will Be President", "label": "pos"},
{"text": "Why Do We Hear More About Hillary's Emails Than Donald Trump's Rape Allegations", "label": "pos"},
{"text": "Why Donald Trump Should Not Be President", "label": "pos"},
{"text": "Why The New Child Rape Case Filed Against Donald Trump Should Not Be Ignored", "label": "pos"},
{"text": "Pantsuit Power flashmob video for Hillary Clinton Two women 170 dancers and no police", "label": "pos"}
]
