[
	{ "text": "The Internet is buzzing today after white supremacist presidential candidate Donald Trump was caught by hotel staff snorting cocaine.  Maria Gonzalez an employee at the Folks INN & Suites Hotel in Phoenix brought room service to his room witnessed it all.  “When I walked in I saw 3 naked prostitutes and maybe 100,000 in hundred dollars bills and a mountain of white powder on the table, I thought it was a dog on the floor sleep but it was his hair piece, he was bald and sweating like crazy. I asked him where to put the food and he asked me did I wanna take a hit, I told him no but I’ll take some of that money, he called me a free loader, told me to get the f*ck out his room and go back to my country”  We reached out to Trumps campaign and he released a statement saying:  “I did not disrespect that woman she’s a god damn liar and I don’t do drugs I do business, when I get elected all hotel employees will have to be U.S. Citizens, they keep taking real American people’s jobs and that will stop, not on my watch”  Maria Gonzalez has a cell phone video of what happened and has contacted several media outlets to sell the footage. So expect the video to hit the Internet any day now. Stay Tuned….", "label": "Fake"},
	{ "text": "TRUMP TOWER — With his poll numbers among black voters hovering around 1%, presumptive GOP nominee Donald Trump reportedly tapped actress and FOX News contributor Stacey Dash as his “Negro Outreach Program” Ambassador.  “She connects with that group,” said Trump, “and she’ll be terrific. Did you see her at the Oscars? She was terrific as the Minority Outreach Director, so we brought her on board. We’re lucky to have her. She’s controversial, but she’s one of the good ones.”  Dash recently created controversy by calling Grey’s Anatomy actor Jesse Williams a “plantation slave” after his BET Awards speech calling for an end to racism and what he called “cultural appropriation.”  Trump said now more than ever, “especially with ‘Crooked Hillary’ siphoning off my blacks,” minority outreach is the difference between winning and losing in November.  “You know what will happen,” said Trump. “The media will come down on me for saying ‘my blacks.’ They did that in California with that African-American fellow in the crowd, but you know what? I don’t’ care. Stacey will respond to all the groups we need to reach.”  One of those groups is the transgender community, Last June, the Clueless actress’ comments about bathroom use by transgender individuals created heated controversy. Dash said people who “can’t decide what they wanna be that day” should go to the bathroom “in the bushes.”  Sources say Trump’s camp may even be vetting Dash for vice president. So far, Trump’s short list includes New Jersey Gov. Chris Christie, and former House Speaker and presidential candidate Newt Gingrich.  “She’s very well-informed. She’s quite affected. We’ve been looking into it,” said Trump.  When asked if the term “Negro” was a proper term to use in 2016, a Trump spokesman said, “The trouble with saying ‘African-American’ is that not all blacks are from Africa, and some of them aren’t even Americans. Some of them are from Central America, and even Puerto Rico.”  “To be inclusive, we decided against ‘colored,’ since the NAACP still uses that. We said no to ‘black,’ because that sounded too polarizing. In the end, we went with ‘negro.’ It’s historically accurate. Nothing racist about it.”  “Not everything is about race,” added the spokesman. “We hope Stacey Dash will make that fact clear to you people once and for all.”  UPDATE: OMAROSA WILL NOT WORK WITH STACEY DASH", "label": "Fake"},
	{ "text": "Donald Trump is looking to assemble a strong team of experienced business leaders as he enters into the intense general election phase. While many expected Trump to consider government leaders, he is leaning on long time WWE boss Vincent K. McMahon to serve as his running mate.  Trump and McMahon met for more than two hours earlier today at Trump’s New York headquarters.  This is not the first time Mr. McMahon has been involved in politics. His wife Linda has run for political office on multiple occasions. His experience and notoriety would offer a boost to Donald’s campaign as it enters the toughest battle he has faced thus far.  “Look, Vince McMahon is someone I deeply admire. We had a discussion today and I think he’s the guy. Listen, this is our country’s future. Vince gave us Stone Cold. Vince gave us The Rock. Vince gave us DX. How can you argue with his record? We need this guy. He gave us the Texas Rattlesnake for god sakes.” Trump told reporters after a media event.  For his part, Vince McMahon said he and Trump had a lot in common.  “We both say ‘you’re fired’, we’re both businessmen, we both love wrestling. You know who else loves wrestling? America. You know who hates wrestling? Hilary.” McMahon said, appearing ready for his possible role as VP.  It remains to be seen if or when Trump would confirm the WWE boss as his potential running mate. Experts say it wont be long if they’ve already met.  ", "label": "Fake"},
	{ "text": "“SHE’S SEXY, SMART, SOPHISTICATED, AND SHE’S INTO OLDER WHITE MEN SO IT WAS A NO BRAINER, WITH HER AND ME ON THE TICKET WE ARE A DEADLOCK TO WIN IN NOVEMBER”  Said Presidential nominee Donald Trump on choosing Stacey Dash as his running mate.  We did a poll of all white males between the ages of 40 and 65 and a whopping 85% will vote for Trump Dash.  This comes off the heels of another poll that was done by TMZHIPHOP.COM on whether or not Black males would sleep with Stacey Dash despite her racism you can see it below…", "label": "Fake"},
	{ "text": "PHOENIX A.Z. (AP) — For months now, rumors have circulated the Internet that individuals were being paid to protest at rallies held by presidential hopeful Donald Trump. Today a man from Trump’s rally in Fountain Hills, Arizona back in March has come forward to say that he was paid to protest the event.  “I was given $3,500 to protest Donald Trump’s rally in Fountain Hills,” said 37-year-old Paul Horner. “I answered a Craigslist ad about a group needing actors for a political event. I interviewed with them and got the part.”  Trump supporters have been claiming that protesters are being paid by the Bernie Sanders’ campaign, but Horner disagrees.  “As for who these people were affiliated with that interviewed me, my guess would be Hillary Clinton’s campaign,” Horner said. “The actual check I received after I was done with the job was from a group called ‘Women Are The Future’. After I was hired, they told me if anyone asked any questions about who I was with or communicated with me in any way, I should start talking about how great Bernie Sanders is.” Horner continued, “It was mostly women in their 60’s at the interview that I went to. Plus, all the people that I communicated with had an AOL email address. No one still has an AOL email address except people that would vote for Hillary Clinton.”  Craigslist ad for Donald Trump protesters A screenshot of the Craigslist ad that Horner says he responded to. The actual ad has since been removed. (Dennis System, File)   ABC News “I knew those weren’t real protesters, they were too organized and smart,” said 59-year-old Tom Downey, a Trump supporter who attended the rally in Fountain Hills. “I knew there was something up when they started shouting all these facts and nonsense like that. The best we could do was just yell and punch em’ and stuff.” Downey continued, “I think we did a good job though. I was shouting at them the whole time, calling them losers, telling them to get a job or go back home to mommy’s house; I got a bunch of high-fives from my fellow Trump supporters. It was a great time.”  When asked about the other protesters at the rally, Horner said he saw most of them during the interview and training for the rally.  “Almost all of the people I was protesting with I had seen at my interview and training class. At the rally, talking with some of them, I learned they only paid Latinos $500, Muslims $600 and African Americans $750. I don’t think they were looking for any Asians. Women and children were paid half of what the men got and illegals received $300 across the board. I think I was paid more than the other protesters because I was white and had taken classes in street fighting and boxing a few years back”    Sarah Bradley, a spokeswoman for Sock It Forward, a group that provides the homeless and those less fortunate with brand new socks told ABC News that she does not understand why Trump protesters would need to be paid.  “I’ll protest that guy for free,” Bradley said. “Trump is creating a place for like-minded, ignorant, bigoted, hate-filled individuals to gather and unite. You wouldn’t have to pay me anything to protest that.” Bradley continued, “Trump supporters are the last kind of people to donate socks to the homeless, they only care about themselves and their white race. I would love the day I ever see a donation from a Trump supporter, I think it would make me change my opinion about them.”  Horner said the group had a mandatory six-hour training class that had to be completed before protesting at Trump’s rally.  “During training we were taught chants to shout like ‘Dump Trump’ and ‘Trump Is A Racist’, things like that. We were told how to respond to anti-Trump comments too. If a Trump supporter said something about how great his wall will be, the Latinos in our group would say, ‘We’re just going to tunnel underneath it.’ They even gave me a shirt to wear at the rally which said ‘F*ck Donald Trump’ along with a sign to hold that said ‘Make America White Again’.”  David Mikkelson, founder of Snopes.com, a website known for its biased opinions and inaccurate information they write about stories on the internet in order to generate advertising revenue, told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the Silverback gorilla my wife Barbara always wanted since she was a child,” Mikkleson said. “We claim ‘to provide evidence for such debunkings and confirmation as well‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent article we wrote debunking a story which claimed Scientology lost its tax-exempt status? Did you actually read our story? Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to rewrite a story we’re debunking if we don’t like it. In one recent story of ours, we actually removed a person’s name from the original article and then called him a liar, oh the hypocrisy, but it is so funny at the same time! We also like to post fake, un-funny, juvenile disclaimers supposedly from the site in question and it is our authors, such as Jeff Zarronandia who are responsible for those gems. We tell our readers that the disclaimer is from the story we are debunking, but a simple google search that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “And lots of people complain about our authors attacking websites and their owners for reasons that are 100% proven false, but since we block archive.org it just becomes their word versus ours. Plus, I know for our writers like Kim LaCapria, it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading malware and viruses, but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about fifteen minutes of real, actual, work.”  ABC News reached out to Hillary Clinton’s campaign for comment but did not receive a response.", "label": "Fake"},
	{ "text": "After hearing about 200 Marines left stranded after returning home from Operation Desert Storm back in 1991, Donald J.Trump came to the aid of those Marines by sending one of his planes to Camp Lejuene, North Carolina to transport them back home to their families in Miami, Florida.  Corporal Ryan Stickney was amongst the group that was stuck in North Carolina and could not make their way back to their homes. Stickey told Hannity.com that he had spent nearly six months serving in Operation Desert Storm between 1990 and 1991 and was eagerly awaiting his return home.   Here is a picture from that day:  plane_photo_w_watermark_0_1463649006  Stickney spent the next few weeks after returning from Saudi Arabia in North Carolina at Camp Lejuene to wind down. Stickney and the 200 Marines were set to return home until an error had been made in the logistics unit and a plane wouldn’t be able to take the Marines home on the date they were set to arrive.  Trump managed to get word of the situation and decided to send a plane to help the stranded Marines.  “The way the story was told to us was that Mr. Trump found out about it and sent the airline down to take care of us. And that’s all we knew….I remember asking ‘Who is Donald Trump?’ I truly didn’t know anything about him,” Stickney said.  Stickeny says that he and his family is forever grateful for lending a hand. His father, a former Eastern Airlines captain and Korean War veteran, even offered Trump a free ride as a way to say thank you for his kind services.  Thanks to Donald Trump, 200 Marines were able to see their families that day.", "label": "Fake"},
	{ "text": "In a recent interview with Pat Robertson’s television network, Donald Trump blathered that antigay conservatives the world over can rest easy knowing that he’s committed to overturning the Supreme Court’s landmark decision that struck down state bans on same-sex marriage nationwide.  The Christian Broadcasting Network’s David Brody asked the GOP presidential frontrunner what he thought of the Log Cabin Republicans calling him “one of the best, if not the best, pro-gay Republican candidates to ever run for the presidency.”  Told that Evangelicals want to trust his stance on traditional marriage, Trump responded:  “I think they can trust me on traditional marriage… and frankly, I was very much in favor of having the court rule that it goes to states, and let the states decide. And that was a shocking decision for you and for me and for a lot of other people, but I was very much in favor of letting the states decide and that’s the way it looked it was going and then all of a sudden out of nowhere came this very massive decision and they took it away. But I was always in favor of state’s rights; states deciding.”", "label": "Fake"},
	{ "text": "A review of FBI Director James Comey’s professional history and relationships shows that the Obama cabinet leader — now under fire for his handling of the investigation of Hillary Clinton — is deeply entrenched in the big-money cronyism culture of Washington, D.C. His personal and professional relationships — all undisclosed as he announced the Bureau would not prosecute Clinton — reinforce bipartisan concerns that he may have politicized the criminal probe.  These concerns focus on millions of dollars that Comey accepted from a Clinton Foundation defense contractor, Comey’s former membership on a Clinton Foundation corporate partner’s board, and his surprising financial relationship with his brother Peter Comey, who works at the law firm that does the Clinton Foundation’s taxes.  Lockheed Martin  When President Obama nominated Comey to become FBI director in 2013, Comey promised the United States Senate that he would recuse himself on all cases involving former employers.  But Comey earned $6 million in one year alone from Lockheed Martin. Lockheed Martin became a Clinton Foundation donor that very year.  Comey served as deputy attorney general under John Ashcroft for two years of the Bush administration. When he left the Bush administration, he went directly to Lockheed Martin and became vice president, acting as a general counsel.  How much money did James Comey make from Lockheed Martin in his last year with the company, which he left in 2010? More than $6 million in compensation.  Lockheed Martin is a Clinton Foundation donor. The company admitted to becoming a Clinton Global Initiative member in 2010.  According to records, Lockheed Martin is also a member of the American Chamber of Commerce in Egypt, which paid Bill Clinton $250,000 to deliver a speech in 2010.  In 2010, Lockheed Martin won 17 approvals for private contracts from the Hillary Clinton State Department.  HSBC Holdings  In 2013, Comey became a board member, a director, and a Financial System Vulnerabilities Committee member of the London bank HSBC Holdings.  “Mr. Comey’s appointment will be for an initial three-year term which, subject to re-election by shareholders, will expire at the conclusion of the 2016 Annual General Meeting,” according to HSBC company records.  HSBC Holdings and its various philanthropic branches routinely partner with the Clinton Foundation. For instance, HSBC Holdings has partnered with Deutsche Bank through the Clinton Foundation to “retrofit 1,500 to 2,500 housing units, primarily in the low- to moderate-income sector” in “New York City.”  “Retrofitting” refers to a Green initiative to conserve energy in commercial housing units. Clinton Foundation records show that the Foundation projected “$1 billion in financing” for this Green initiative to conserve people’s energy in low-income housing units.  Who Is Peter Comey?  When our source called the Chinatown offices of D.C. law firm DLA Piper and asked for “Peter Comey,” a receptionist immediately put him through to Comey’s direct line. But Peter Comey is not featured on the DLA Piper website.  Peter Comey serves as “Senior Director of Real Estate Operations for the Americas” for DLA Piper. James Comey was not questioned about his relationship with Peter Comey in his confirmation hearing.  DLA Piper is the firm that performed the independent audit of the Clinton Foundation in November during Clinton-World’s first big push to put the email scandal behind them. DLA Piper’s employees taken as a whole represent a major Hillary Clinton 2016 campaign donation bloc and Clinton Foundation donation base.  DLA Piper ranks #5 on Hillary Clinton’s all-time career Top Contributors list, just ahead of Goldman Sachs.  And here is another thing: Peter Comey has a mortgage on his house that is owned by his brother James Comey, the FBI director.  Peter Comey’s financial records, obtained by Breitbart News, show that he bought a $950,000 house in Vienna, Virginia, in June 2008. He needed a $712,500 mortgage from First Savings Mortgage Corporation.  But on January 31, 2011, James Comey and his wife stepped in to become Private Party lenders. They granted a mortgage on the house for $711,000. Financial records suggest that Peter Comey took out two such mortgages from his brother that day.  This financial relationship between the Comey brothers began prior to James Comey’s nomination to become director of the FBI.  DLA Piper did not answer any question as to whether James Comey and Peter Comey spoke at any point about this mortgage or anything else during the Clinton email investigation.", "label": "Fake"},
	{ "text": "By Beverly Gates Franklin Graham, son of famed preacher Billy Graham, has urged Christians to vote for thrice married, casino owner Donald Trump. According to Graham, who feels Trump has been chosen by God, the reality TV star was the only thing standing between Christians and death camps.  “The liberal Democrats are openly hostile to Christians,” said Graham in an interview on WEHW radio. “We won’t survive four more years of Democrat-led government. I can see them rounding Christians up and putting us in death camps unless we follow their laws that want to grant special rights to gays and transgender people.”  “Christians need to vote for Trump, he embodies our values,” said Graham.  Apparently, many Evangelical Christians feel they are under siege. FOX News commentator Bill O’Reilly has done several segments on the alleged “War on Christmas.”  Right Wing Watch reported Carl Gallups, an End Times preacher, told World Net Daily that the U.S. government was currently at war with Christians.  “In my opinion, this particular election is right up there with the presidential elections before and during the Civil War,” said Gallups. “We are in a kind of societal civil war right now! And we are certainly in a great spiritual civil war in our nation, perhaps one like never before.”  Sharing is caring!", "label": "Fake"},
	{ "text": "There’s no telling how many times during the campaign Hillary Clinton has brought up America’s nuclear codes, and how important it is that someone who’s riled by a tweet never be allowed anywhere near them.  She also repeated on #DebateNight the established Democrat talking point that the contents of the documents posted by WikiLeaks aren’t nearly as important as the fact that Russia is hacking our servers — a threat so severe that she decided to set up her own private email server in her house.  It’s fine, though: she assured the public that just because she didn’t know what the (C) on her emails indicated, it didn’t matter as she treated everything as if it were at the highest level of classification … well, just about everything.    Follow  John T. Miller @cyvault No one caught that Crooked Hillary stated on LIVE TV what our NUKE RESPONSE TIME IS 4 MIN??@FoxNews @DRUDGE #debatenight #ChrisWallace 11:22 PM - 19 Oct 2016   4,101 4,101 Retweets   3,957 3,957 likes What, is that important? Turns out a whole lot of people caught it, most likely including the people behind the hacking of America’s servers.   Follow  The Libertarian Prof @TLProfessor Did Hillary just leak TS information on national TV regarding nuclear response time? #debatenight 9:35 PM - 19 Oct 2016   273 273 Retweets   219 219 likes  Follow  American????Comrade @WrongThinkBlog #DebateNight Did Hillary just tell the entire world what our nuclear response time is? WHAT THE ACTUAL F**K!?!?!? 9:36 PM - 19 Oct 2016   96 96 Retweets   91 91 likes Looks that way.  Hillary dropped, on live #debatenight, Response time between presidential order and nuclear missile launch. Info isis classified TS NC2.  — Tharru (@VoxRomani) October 20, 2016  Follow  Kevin #Trump45# @CNY_KFieLd Hillary disclosed classified information tonight. HIGHLY classified information. Our nuclear response time is top secret. 11:19 PM - 19 Oct 2016   185 185 Retweets   151 151 likes Correction: it was top secret.  First it was Vice President Joe Biden who, while campaigning for Hillary, thought he’d point out exactly who in his entourage was carrying the nuclear codes with him, so it was thoughtful of her to complete the gift set to the country’s enemies. But like President Obama said, “there’s classified, and then there’s classified.” Anyone could basically get this info “open source.”   Follow  Mr.savage magoo @haydenchad20 Good thing Hillary told everyone about our nuclear response time. Yet another military strategy given to everyone ?? 11:07 PM - 19 Oct 2016   55 55 Retweets   28 28 likes It was an honest mistake; surely they’d let it slide if someone in the military did the same thing.  Why did hillary give away nuclear response time on international television? Let me guess 'she didn't know it was classified' #DebateNight  — Joseph Shaw (@harpandjoseph) October 20, 2016  Follow  Alcoholic @austin_klavins Was the nuclear response time of '4 minutes with an inability to cancel' that Hillary mentioned tonight classified by any chance? #debate 11:34 PM - 19 Oct 2016   39 39 Retweets   29 29 likes What difference, at this point, does it make?", "label": "Fake"},
	{ "text": "Hillary in hot water over her email server, again. Sacramento, CA — Democratic nominee Hillary Clinton is in hot water again after nearly 5 million uncounted California electronic ballots were found on her email server by the F.B.I. The majority of those ballots cast were by Bernie Sanders supporters.  The election commission has an emergency meeting scheduled for tomorrow morning to discuss a possible vote recount which will include the newly-found ballots.  Ms. Clinton has already come under fire during this election cycle over using her private email server for personal use, including storing and sending classified information with it. There has been a formal investigation, but no charges have been filed in that case. Some of the charges are facing several charges.  Ms. Clinton’s public relations official released a brief statement saying, “Hillary does not know how those ballots ended up on her server. We are conducting an internal investigation into the matter.”  These ballots could change the fortune of Bernie Sanders in his bid for the presidency as all the ballots found on Hillary’s server were cast votes cast for him, with the exception of the one write-in for Perot.", "label": "Fake"},
	{ "text": "Before running against billionaire real estate mogul Donald Trump for the presidency, Secretary of State Hillary Clinton told an audience at a private, paid speech she wanted to see more successful businessmen and women run for office because they can’t be bought.  In a speech made public by Wikileaks – which released an email from Hillary for America Research Director Tony Caark containing three attached speeches given at a private Goldman Sachs events – Clinton spoke and took audience questions at the “Builders and Innovators Summit” hosted by Goldman Sachs on October 29, 2013.  Answering a question about businessmen in politics, Clinton said that they are “most often the people that look over the horizon,” and therefore share a vision that many politicians of today lack. “And that’s a very good question and thank you for asking it. Yes, I would love to see more businessmen go into politics because I believe they would bring in an entirely different mindset and strategies than what we’re used to seeing traditionally,” she opined.  And then she just had to go on. “In fact, when you say businessmen and women, I can’t help but think of a particular one that I would just love to see running for the presidency at some point in the future,” Clinton added. “I don’t know what it is exactly about him, I can’t quite put my finger on it, but my instinct is almost never wrong. And it’s telling me that Donald Trump would be very successful if he were to venture into politics in the future.”  Asked to elaborate on her statement, the former Secretary of State argued that she thinks that businessmen “can’t be bought” and that they’re “very honest.” “And I think that goes especially for Donald Trump, whose successful projects and business ventures have made him synonymous with big business and, more importantly, creating thousands of jobs. I also think he understands the philanthropic and charitable side of things quite well, which is a crucial skill for any politician,” she praised her current counter-candidate.  “I think he has a lot to offer to this country and its people, especially when we’re talking about the economy,” she continued. “Donald Trump has single-handedly helped stop the recession, more so than dozens of other so-called billionaires. And I don’t know how the experts on the matter feel, but in my book that’s hard evidence of the man’s business prowess and integrity, as well. And I think everyone would agree those are commendable character traits for anyone looking to tackle the most difficult problems and challenges in the world, quite literally.”  “So, yes – Donald Trump is someone I could very easily see winning the support of the people. And I don’t think he would do that with his flammable rhetoric and negotiation skills – which are both things he’s known for – but with common sense and respect for his fellow countrymen. But, most of all – I think his relationship with the opposite sex would bring him the most political points. I think he respects women and treats them as equals and I also think that would bring him a significant lead over anyone unlucky enough to be running against him,” she ominously concluded in her 2013 speech.", "label": "Fake"},
	{ "text": "On a recent trip to Texas, Hillary Clinton showed she is directly in the pocket of Pakistani Muslims!   Sources close to the private fundraiser held for Hillary Clinton in Beaumont, TX told 12News it raised hundreds of thousands of dollars.  Some estimates put the amount collected at half-a-million dollars, making it one of the top five private fundraisers Clinton has had in this country.  Pakistani businessman Tahir Javed hosted the reception for Clinton at this home in West Beaumont.  Former U.S. Representative Nick Lampson, who attended the event, says 250 people were there.  Lampson says Clinton spoke about education, healthcare and individual freedoms for people of all backgrounds and faiths.  Many of the Pakistanis at the event were pleased with Clinton's vocal support of the Muslim religion.  Aisha Zahid said, 'Talking about Muslims and favoring Muslims, so I really appreciate her whatever effort she is making against Islamaphobia, so I really think she needs to be the next President of the United States.'  Also in attendance, congress people from the Houston area, Sheila Jackson-Lee and Al Green.  But not everyone was a fan.  A handful of protesters demonstrated near the event, over Clinton's response to the Benghazi attack and her email controversy.  With all the terrorism perpetrated against the United States and our people - from 9 11 right up to the 14 people machine-gunned to death in San Bernardino, CA, -- why would Hillary do this?  Because Hillary Clinton is in the pocket of Muslims.  Think we're over-stating things a bit?  We respectfully remind you of this tweet:", "label": "Fake"},
	{ "text": "Inishturk, an island off the main coast of Ireland, has now joined Canada in officially accepting Americans requesting political asylum from a Donald Trump presidency.  The island has been experiencing a population decline in recent years, and they decided to try to reach out to Americans seeking to flee our current political dystopia by offering a new place to live if the idea of Donald Trump and the Republicans following his lead are just too much.  Mary Heanue, Inishturk’s development officer, was quoted as saying:  I’ve heard there are quite a few people in America looking to move to Ireland and other countries if Donald Trump becomes president. I’d like them to know that we’d love to see them consider moving over here.  Our big concern is employment and trying to encourage families to move over here because the population is declining. The island featured on an Irish TV documentary last year which gave us great publicity and a good few extra bookings. But we ended up having a terrible summer and a lot of people canceled.  They’d be given a huge welcome and they’d find this is a fantastic place to live and to bring up children. Their kids would probably get the best education anywhere in the country too, because the teacher to pupil ratio is nearly one-on-one.  Although winters can be hard and it’s the kind of life that wouldn’t necessarily suit everyone, they’d find it very peaceful here and they’d soon find out there’s nowhere as nice in the world on a summer’s day than here.”  The website IrishCentral.com also got in on the action recently, by publishing their own guide on moving to Ireland in case Donald Trump is elected.  The website describes the details, and realities, of moving to Ireland. It isn’t particularly cheap and the financial restrictions on it might preclude some people from being able to take advantage of it.  However, there are some big things on the plus side. The gun laws are restrictive and you won’t see wannabe cowboys carrying handguns openly in Ireland – a huge plus. They have strong social welfare and services, plus did I mention universal heathcare? Not exactly a terrible idea…  They also do take some well-placed digs at our Republican problem, by making a few short jabs at the likes of Bill O’Reilly and Donald Trump in particular, by stressing that you request an absentee ballot so you can still vote against Donald Trump for a nice middle finger from across the pond.  More than likely, Trump will not get elected. However, it never hurts to have a backup plan, especially if you don’t fit into one of the new state-approved ethnic groups (whites only) that will be one of the features of a possible Donald in the White House.", "label": "Fake"},
	{ "text": "Top ISIS leader now believed to be the number two behind the terrorist organization, Amadh Abu Makmud Al-alwani, put up a video this week following the second presidential debate asking American Muslim voters to support Hillary Clinton.  The controversial video that was taken down by YouTube only hours after it was uploaded showed top ISIS leader Amadh Abu Makmud Al-alwani threatening those who would decide to vote for Donald Trump and calling them “infidels” and “goat f—-ers”.  “ All Muslims who will show support for the dog-faced Trump are guilty of masiya (mortal sin) ”  – ISIS No.2 leader, Amadh Abu Makmud Al-alwani  He also claimed that even if Hillary was a woman and a “two face devil”, had the “charm of a pig” and was “treacherous as the snake”, that the Democratic presidential hopeful was at least in league with the “allied countries of the Islamic state” such as Turkey, Saudi Arabia and Qatar.  Supporting the “dog-faced” Trump  Al-alwani also warned all Muslims not to take his warnings lightly and that supporters of Trump would be severely punished on earth and in Jannah (afterlife).  “Trump is a dog, he is the scum of the earth. He boasts that he will take our oil and join Russia, Syria and the Shia Iranians against us in our holy fight” he added, visibly angry.  “This (dog-faced) scumbag must not reach Washington. Although it is a sin to put an inferior being such as a woman into a position of power, it is the true plan of Satan to divide the Muslims of America. It would be dirty and danis (filthy) to vote for Trump,” he explained.  Amadh Abu Makmud Al-alwani has risen as a prominent ISIS leader figure since coalition forces carried out a “precision strike” last August, successfully targeting Abu Muhammad al-Adnani, number two of the terrorist organization at the time.", "label": "Fake"},
	{ "text": "Today Wikileaks released what is, by far, the most devastating leak of the entire campaign.  This makes Trump’s dirty talk video looks like an episode of Barney and Friends.  Even though when Trump called Hillary the ‘founder’ of ISIS he was telling the truth and 100% accurate, the media has never stopped ripping him apart over it. Today the media is forced to eat their hats because the newest batch of leaked emails show Hillary, in her own words, admitting to doing just that, funding and running ISIS.  John Podesta, Hillary’s campaign chair, who was also a counselor to President Obama at the time, was the recipient of the 2014 email which was released today.  Assange promised his latest batch of leaks would lead to the indictment of Hillary, and it looks like he was not kidding.  The email proves Hillary knew and was complicit in the funding and arming of ISIS by our ‘allies’ Saudi Arabia and Qatar!", "label": "Fake"},
	{ "text": "Kid Rock (real name Robert Richie) interrupted a Hillary Clinton campaign event during the Democratic convention when he shouted ‘Vote Donald Trump’ and ‘Hillary For Prison 2016’ from behind the DNC presidential contender.  After entering the rally, Kid Rock blended in with the crowd before starting a loud ‘Vote Donald Trump’ chant. Numerous people in the crowd were swayed and joined the chant with Kid Rock after realizing he is the American hero who wrote ‘Bawitdaba’.  Hillary Clinton reportedly looked at Kid Rock with fire in her eyes, before telling him that she was “glad nu metal was dead”.  The ‘All Summer Long’ singer was able to get into the event by taking the Clinton pledge, a sacred ritual that requires you to sacrifice a lamb to prove your allegiance to the Clinton dynasty.", "label": "Fake"},
	{ "text": "Another long-time “lover” of Bill Clinton has come forth, with a new book, Hillary, The Other Woman (WND Books), spilling beans on his insatiable satyriasis and Hillary’s hell-bent political ambitions.  She is Dolly Kyle, an attorney in her 60s, who first met Bill Clinton in Arkansas in the summer of 1959 when she was 11 years old and he 12. Supposedly, it was love at first sight — a sexual relationship that lasted 32 years — through high school (although she says they didn’t have sex until after graduation), Bill’s law school at Yale, his years as Arkansas governor, and until his entrance into the White House.  Dolly Kyle in 1998  Dolly Kyle in 1998  This is what Dolly Kyle wrote in her book (source: Daily Mail):  (1) In 1987, Bill Clinton had had 2,000 sex partners:  Dolly said she started “sleeping with Bill” after high school and admits “Billy was a sex addict; I was a codependent”. In 1987, Bill Clinton was “undone” by Wilt Chamberlain’s claim to have slept with 20,000 women. Bill told Dolly, “That’s ten times more than I’ve had!” — which meant Bill had sex with 2,000 women in 1987, which means that the number would be even higher by 2016.  Hey, Dolly Kyle, that’s some “love” Bill Clinton had for you!  (2) Bill Clinton had wanted to be president since high school:  Bill first confessed his desire to be president to Dolly back in high school, and began actively pursuing it after the summer of 1963 when, as an Arkansas delegate to Boys Nation, he had a photo-op with President John F Kennedy in the Rose Garden.  (3) Bill Clinton called blacks “niggers”:  Dolly wrote that she frequently had heard Bill refer to blacks in the South as “G**damn n****r”.  (4) Bill Clinton never used a condom, but seemingly was unconcerned because, as he told Dolly, he had a low sperm count. (Note: Other reports say Bill Clinton is sterile from mumps.)  (5) It was a marriage of convenience — of Bill and Hillary using each other:  Hillary’s role was financial provider to get Bill elected president, and pursue “his addictions to politics, power and sex”. Bill’s mother, too, had supported the family financially while his stepfather drank. Dolly wrote: “Hillary’s role of providing financial security for Billy was part of her motivation for the series of financial crimes (yes, crimes) that she committed over the decades. Hillary was upholding her part of the deal to get Billy elected president, after which it would be her turn to be the first woman in the Oval Office.“  (6) Bill Clinton called Hillary his “warden”:  Hillary kept Bill’s nose clean in the public mind and had private investigators tracking Bill and the “women he was dating or attacking” because she was riding his coattails to political power. Dolly writes: “Hillary needs the power” and she is ruthless.  College-age Hillary Clinton   College-age Hillary Clinton  (7) Hillary was sweaty and had hairy calves and toes:  Dolly first met Hillary on the evening of May 28, 1974 at the airport in Little Rock. It was election night and Senator William Fulbright was running for re-election. Fulright was Bill Clinton’s champion — giving Bill his first Senate job while Bill attended Georgetown University; supporting him for the Rhodes Scholarship and a teaching job at Arkansas Law School; introducing him to powerful people in Washington and financial backers for Bill’s first congressional campaign that he eventually lost.  Dolly describes Hillary as “a dowdy-looking woman who appeared to be middle-aged” with “thick eyebrows melded together stretching across her forehead,” wearing “coke-bottle-thick lenses” and “a misshapen, brown, dress-like thing that must have been intended to hide her lumpy body. The garment was long, but stopped too soon to hide her fat ankles and her thick calves covered with black hair. Thick brown sandals did nothing to conceal her wide feet and the hair on her toes“.  Hillary glared at Dolly with hostility. Dolly writes: “In that moment, I noticed that the woman emitted an overpowering odor of perspiration and greasy hair. I hoped that I wouldn’t gag when she got in the car.” When Bill introduced the dowdy woman as Hillary, Dolly “was stunned” and thought “it was ‘some kind of a sick joke’ – a woman in a hideous disguise.”  (8) Bill discarded his mentor-benefactor Sen. Fulbright when the latter lost reelection:  Dolly writes that although the plan had been to go the Fulbright’s campaign headquarters, when the votes came in showing he was losing, Hillary signaled to Bill and the plan was changed. He would head back to the airport. Bill told Dolly, “I don’t want to be seen with a loser.”  (9) Hillary’s attempt to carve a political career for herself in Washington sizzled:  A lawyer and graduate of Yale, Hillary wanted a career in Washington but she flunked the DC bar exam. Dolly writes that at the time of her meeting Hillary for the first time, Hillary was working in Washington, DC and “trying to become a political force under her own steam.” But “It was a futile attempt” and Hillary’s job with the Watergate investigation ended. Dolly believes “Hillary showed the same lack of integrity there that would later get her into more serious trouble.” (See “Hillary Clinton was fired for lying when she was 27 years old“)  (10) Hillary was a lesbian:  Although Bill did not use the word “lesbian,” he hinted at it by keep referring to Hillary’s “lifestyle”.  In March 1979, Bill told Dolly he wanted a child but had a low sperm count: “We need to have a baby so we can appear to be a normal couple. We need to do something serious to take attention off the Warden’s lifestyle.” He asked Dolly to pray for a baby. Dolly suggested he had to bite the bullet and sleep with Hillary. Within a year, Chelsea Victoria Clinton was born and Bill fell head over heels with the little baby. (See “Bill Clinton not Chelsea’s biological father“)  Chelsea Clinton (l) and Wester Hubbell  Chelsea Clinton (l) and Wester Hubbell  But Hillary felt trapped being at home with a baby and couldn’t wait to get back to work. She asked her friend, Louise: “How long do I have to stay at home with this kid?” Hillary stayed home with baby Chelsea for three months before returning to work. Bill told to Dolly that it was the baby that kept the couple together.  (11) Hillary’s other attractive qualities:  Hillary resented that she had to dress like Southern women; she visited dress shops but generally didn’t buy anything. Dolly also confirms Secret Service agents’ accounts of Hillary’s foul mouth, anger towards the White House and Arkansas governor security detail, and physical abuse of Bill. In Arkansas, she had “hissy fits” and threw dishes at Bill in the kitchen, breaking a kitchen cabinet door. When Bill lost the governorship after one year, Hillary was furious, knowing that she was no longer the state’s First Lady and had to move out of the governor’s mansion and into a tiny house. (See “Ex-Secret Service agent: Jekyll & Hyde personality makes Hillary unfit to be President”)  Dolly writes: “Hillary is not a leader. She is a coattail-clutcher who has a litany of jobs with no accomplishments,” having failed as co-president, failed as senator “unless you are impressed with the bills she introduced to name a couple of post offices,” failed as secretary of state and as a defender of women over the past 40 years. Hillary instigated threats on women who had sex with her husband, a serial sex abuser.  (12) Dolly’s summary opinion of the Clintons:  Despite her long, 32-year sexual (it’s true love!) relationship with Bill Clinton, Dolly Kyle has only contempt for the Clintons. She writes:  “Billy and Hillary Clinton continue to be lying, cheating, manipulative, scratching, clawing, ruthlessly aggressive, insatiably ambitious politicians who are giving public service a bad name – and nothing about them has changed in the past forty-plus years, except that they have deluded more and more people. The Clintons and their misled supporters have rewritten history to suit their political agenda, which is to get votes to get power to get money to get more power to get more money. The Clintons’ vicious cycle of intertwining greed and power addictions will have no limit, unless someone stands up and announces. The emperor has no clothes! Ideology, integrity, and love of country were never involved in the ‘Billary’ quest for the White House. It was always a codependent, co-conspiratorial grab for money and power and more money and more power. Unfortunately for them and for the United States of America, there is never enough to satisfy addicts.”", "label": "Fake"},
	{ "text": "The Mexican government announced they will close their borders to Americans in the event that Donald Trump is elected President of the United States. President Enrique Peña Nieto announced the country fears Americans will flood their country and bring violence and chaos to their streets.  “Americans have a well-documented history of violence and we must act to keep our country safe,” President Nieto stated. “Many Americans have expressed a desire to relocate to our country in the event that Donald Trump becomes President. We can not have Mexico flooded with criminals and rapists. They are a violent nation and they won’t send us their best. We must be vigilant and keep a close eye on what could possibly transpire.”  The unprecedented move would mark a dynamic change in how Mexico handles foreigners. Many Mexicans fear the move could adversely affect trade relations with the United States. Mexico is currently the United States 3rd largest goods trading partner with $507 billion in total (going both directions) goods trade during 2013. Goods exports totaled $226 billion; Goods imports totaled $280 billion. The U.S. goods trade deficit with Mexico was $54 billion in 2013.", "label": "Fake"},
	{ "text": "WASHINGTON, D.C. –   Former presidential intern and the world’s second most famous presidential lay, Monica Lewinsky, has gone on record saying that she will be voting for her old flame’s wife, Hillary Clinton, in the next election.  Lewinsky, who is a staunch anti-bullying activist, says she couldn’t possibly vote for Trump, because he’s “the biggest bully” she’s ever seen.  “I’ve spent years trying to stop bullying, in life and online, with children, teens, and adults, so what kind of message would it send if I voted for Donald Trump?” asked Lewinsky. “I understand that there are some weird ramifications of me voting for my former lover’s wife, but you know, those were different times. That dress has long since been burned, if you know what I mean.”  Lewinsky says that she had originally thought about voting for Jill Stein, but Stein’s anti-vaccine sentiment made her think better.  “It’s definitely a woman’s place to be in the Oval Office, behind the resolute desk, and I don’t just mean on her knees,” said Lewinsky.", "label": "Fake"},
	{ "text": "LOS ANGELES, Calif. – Former first lady Nancy Reagan, who died on March 6 at the age of 94, remained mentally alert “until the very end,” according to a private nurse, who told reporters Mrs. Reagan’s last words to her were, “Do not vote for Donald Trump.”  “She watched all the [GOP] debates,” said the nurse, identified as Althea Thoone. “She was very alert and kept up with all the news and current events, especially about the election. She said no true Republican would cast a vote for Donald Trump.”  “She was not happy at all because I don’t believe she thought Donald Trump was a real Republican. She took a turn for the worse after the [11th] debate when he started talking about his private parts, and all that other nonsense about Mitt Romney getting down on his knees.”  During the debate held on March 4, Trump responded to Romney’s public attack against him by saying, “He was begging for my endorsement. I could have said, ‘Mitt, drop to your knees.’ He would have dropped to his knees.”  Trump also alluded to the size of his penis during the debate, responding to a joke about the size of his hands told by Florida Sen. Marco Rubio.  The so-called 11th Commandment, Thou shalt not speak ill of another Republican, once espoused by Ronald Reagan, now seems to be a relic from the past, when a kinder, gentler political sensibility existed in Washington, at least between members of the same party.  “He broke that commandment, and a few others too, as far as I’m concerned,” said Thoone, who became somewhat of a confidant to Mrs. Reagan in her last years. “She remembered that crack he made about her not being ‘very beautiful’ too.”  “I wouldn’t say Donald Trump caused her to pass, because that’s up to the Lord, but he certainly didn’t help any. She couldn’t believe what she was seeing and hearing up there. She would just look over to me and shake her head.”  Thoone reports that Mrs. Reagan hoped to attend at least one of the GOP debates, but the strain of travel and her advanced age prevented such a trip. She was happy to see George H.W. Bush and former first lady Barbara at the Feb. 25 debate, says Thoone.  Mrs. Reagan’s last public appearance was on July 6, 2015, at her 94th birthday celebration.", "label": "Fake"},
	{ "text": "Washington, D.C. – South African Billionaire, Femi Adenugame, has released a statement offering to help African-Americans leave the United States if Donald Trump is elected president. According to reports, he is offering $1 Million, a home and car to every Black family who wants to come to South Africa.  Concerns about Donald Trump becoming president has prompted a South African billionaire to invest his fortune in helping African-Americans leave the United States to avoid further discrimination and inequality. With the recent media coverage exposing police brutality and racially motivated crimes against African-Americans, Femi Adenugame, has decided to put his fortune to what he believes is good use. He has created the “Back To Africa” movement in efforts to assist African-Americans in returning to their “motherland” and starting a fresh life. According to reports, Femi Adenugame has invested over $500 Million into the project. Adenugame owns 5 commercial 747 jets and a fleet of cruise ships which he plans to use to transport those who are interested in “returning” to Africa from the United States.", "label": "Fake"},
	{ "text": "Following Wednesday’s presidential debate Pentagon officials found themselves completely dumbfounded as to why former Secretary of State Hillary Clinton would feel it appropriate to announce U.S. Special Access Program intel on national television.  According to sources within the Department of Defense speaking under anonymity, Clinton likely violated at least two Dept. of Defense SAP protocols during the debate by announcing on live television the United States Government’s response time for a nuclear launch.To the dismay of intelligence officials, the fact that this top secret information is now publicly known not only proves that Clinton is “unfit to be commander-in-chief,” but it also poses a direct threat to national security.  One high ranking intelligence official explained that any time frame calculated pertaining to a US nuclear launch “would have merely been an educated hypothesis, absent leaked documents and there have been no such breaches” prior to Clinton’s admission Wednesday.  Via TruePundit  “Secretary Clinton proved tonight she is unfit to be commander-in-chief,” a top-ranking DOD intelligence source said. “What she did compromises our national security. She is cavalier and reckless and in my opinion should be detained and questioned so we can unravel why she did what she did.”  According to Pentagon sources, the information Clinton disseminated publicly is Top Secret intelligence governed under the U.S. Special Access Program (SAP) which dictates safeguards and protocols for accessing and discussing highly classified and Top Secret intelligence. The specific details of the country’s nuclear response time discussed by Clinton, sources said, are only known by a handful of individuals outside top military brass…  “Targeting options by ICBM (intercontinental ballistic missiles), air or sea, launch order, launch procedures and response are some of the most secretly guarded tenets of national security and nuclear war policy,” a Pentagon source said. “It’s truly incredible that (nuclear) response time as part of an ERO (Emergency Response Option) is now out there in the public domain to our adversaries.”  U.S. Defense sources said according to developed U.S. counterintelligence, military officials in China, North Korea, Syria, Russia, Iran and even actors like ISIS had no previous definitive intelligence to determine the U.S. nuclear response time, especially during an ERO, prior to Clinton’s admission Wednesday night. Sources reluctantly acknowledged her calculations were accurate.", "label": "Fake"},
	{ "text": "atican City – In a final speech to the synod, Pope Francis endorsed Senator Bernie Sanders for President of the United States, while taking some clear swipes at conservatives who hold up church doctrine above all else, and use it to cast judgment on others.  “The synod experience also made us better realize that the true defenders are not those who uphold its letter, but its spirit; not ideas but people; not formulas but free availability of God’s love and forgiveness,” Pope Francis said. “I see in Senator Bernard Sanders a man of great integrity and moral conviction, who understands these principles and genuinely wants what’s best for all people  The pope went on to criticize ultra-conservatives, saying church leaders should confront difficult issues “fearlessly, without burying our heads in the sand.” It was the latest in a series of admonitions to bishops by the pontiff, who has stressed since his election in 2013 that the 1.2 billion-member Church should be open to change, side with the poor, and rid itself of the arrogance and unfettered narcissism that has alienated so many Catholics in recent years.  Naturally, conservative Catholics are not happy with Francis for being so outspoken on social issues and American politics. “The pope needs to stick to religion, and stay the hell out of politics,” says Cardinal Justin Francis Rigali. “Conservative Catholics are losing faith in the Church, and this falls directly on the shoulders of Pope Francis with his socialist ideology and warped political views.”  Conservative news outlets like Fox News have taken issue with Pope Francis on everything from climate change to income inequality. Bill O’Reilly has numerous times compared Pope Francis to Bernie Sanders, accusing both of being “false prophets.”  Liberals and progressives on the other hand applaud the pope for bringing social and environmental issues to the forefront of the Catholic Church. “He’s a Catholic rockstar,” says Prudence Bradley, 19, from upstate New York. “Pope Francis has made it cool to be a Christian again.”", "label": "Fake"},
	{ "text": "Barack Obama has sensationally told CNN’s Wolf Blitzer that he will NOT vacate the Oval office if Donald J. Trump is elected the 45th President of the United States.  The current president claims he is “fully prepared” to ignore the popular vote if it means stopping Trump, having found what he believes is a little known loophole that would allow him to remain in charge until a re-election is called.  “As president, I must do what I feel is in the best interests of our nation,” he explained. “If the American people elected ‘the Donald’ then I will be forced to take whatever actions I deem necessary.”  When asked by the CNN anchor if he would remain in charge, Obama’s response was firm. “I am not standing down as president if it means four years of President Trump,” he said categorically.  The president was asked what exact lengths he would go to, to prevent the billionaire from being sworn in on January, 20th, 2017. “I am prepared to file a motion of ‘no confidence’ in our citizens thereby taking their vote away from them,” he confessed.  “Wait, you’re willing to impeach the American people as voters?” a possibly stunned Blitzer asked. “Yes, if necessary,” the President responded. “I cannot allow him into this chair, with his finger so close to the button. The power would go to his head immediately.”  Trump Claims Not Deporting Obamas Under Muslim Ban Would Be ‘Discriminatory’ | Obama refusing to leave BREAKING: Trump Claims Not Deporting Obamas Under Muslim Ban Would Be ‘Discriminatory’ | Obama refusing to leave Obama even suggested he will barricade himself and his family inside the White House if it means stopping the Trump family from taking up residency there. “I’ve instructed the Secret Service to use full force in defending the White House from the Trump family. Joe has already expressed his willingness to die multiple times in order to keep them out of here.”  When questioned by Howard Stern, Trump seemed unconcerned by the President’s stance. “Don’t worry, we’ll get some of the second amendment people to sort him out pretty quickly.”", "label": "Fake"},
	{ "text": "Home » News » Putin: Hacked Emails Reveal That Clinton Threatened Sanders’ Wife Putin: Hacked Emails Reveal That Clinton Threatened Sanders’ Wife Posted on July 29, 2016 by Baxter Dmitry in News, US    0 Comments The Kremlin claim the Clinton campaign      Kremlin sources say the Clinton campaign “sent their goons to give Jane Sanders the shakedown,” in order to end the Bernie Sanders campaign before the convention, citing evidence from one of 10,000 Hillary emails Putin has in his personal possession.   The Clinton campaign needed Bernie Sanders on board before the emails were leaked as they contained evidence that confirmed his suggestions of Democratic establishment bias and would have given him unstoppable momentum heading into the convention – had he chosen to play that game.  The Kremlin have threatened to release 20,000 emails that Russia have hacked from Hilary Clinton's email server. Kremlin To Release 20,000 Hacked Hillary Clinton Emails  However after the meeting with the Clinton team Sanders unexpectedly suspended his previously gung-ho campaign, and although he refused to wholeheartedly endorse her, he signalled to his supporters that his run for President was effectively over.  Kremlin sources have denied the DNC claims that Russian state-sponsored hackers are behind the email leaks, with Julian Assange also stating the DNC claim is a politically motivated “lame conspiracy smear.”  Despite the FBI asking the Kremlin for copies of any emails they have in their possession, it is understood the Kremlin has not released anything to anyone, including Wikileaks.  According to Kremlin sources, the source of the Wikileaks email trove could have come from “a huge number of possible sources“, as “intelligence communities around the whole world have copies of Hillary’s emails. Everybody is talking about them.”  Senior staff in the Kremlin have been allowed to see the emails, however Putin alone has access to them and keeps them on his personal laptop, under lock and key. He has been heard staying up until 2am, reading their contents out loud, roaring with laughter.  President Vladimir Putin is said to be amused by Democratic Party attempts to portray him as the villain, when their own failings are on display for all to see. “They always need a babayka [boogeyman] to frighten people with. I am the Eastern boogeyman, it seems.”  Republican presidential nominee Donald Trump reached out to the Kremlin, promising them “rewards” if they release Hillary Clinton’s missing emails.  “Russia, if you’re listening, I hope you’re able to find the 30,000 e-mails that are missing,” Trump said on Wednesday.  “I think you will probably be rewarded mightily by our press. Let’s see if that happens. That will be next.”  President Vladimir Putin’s spokesman, while not directly denying Russian involvement in the hack, said Moscow would never interfere in another country’s election.  “President Putin more than once has said that Russia would never interfere and does not interfere in the internal affairs of other countries, especially in the electoral process,” Dmitry Peskov told journalists Wednesday in a conference call.  Peskov also criticized the willingness to accuse Russia of wrongdoing. “If we talk about some sort of suspicions against a country, then it is necessary at a minimum to be precise and concrete,” the spokesman said.  He said “speculation in this case does not show a constructive attitude.“", "label": "Fake"},
	{ "text": "It has been more than fifteen years since Rage Against The Machine have released new music. The members of the band have involved themselves in various other projects during their lengthy hiatus, but one pressing issue has forced the band to team up once again.  In a statement posted online, Rage Against The Machine announced they would be releasing a brand new album aimed at spreading awareness about “how awful Donald Trump is“.  “We must pick up the microphone, the guitar, the bass, and the drums to tell the world how bad Donald Trump is. We have stayed silent for many years, but enough is enough.The bulls are on parade.” the statement said. The band plans to perform outside of the Republican National Convention in Cleveland, Ohio on July 18th. This isn’t the first time Rage Against The Machine showed up outside of a political convention. The group played to a massive crowd outside of the 2000 DNC.  Their music video for ‘Sleep Now In The Fire’ famously predicted a Trump presidential run.  You will be able to pre-order the album starting April 1st. The album is tentatively named “Rage Against The Donald” and a release date has not yet been revealed.  Here is the official track listing:  Sleep Now Trump You’re Fired Trump’s Bullshit On Parade There Aint No Spray-Tan Here Trumpify Renegades Of Trump Lights Out, Trump Is A Racist, Yo! Trump was reportedly furious about the album, telling the media and others not to spread the word about their ‘disgusting music’. Clearly, he doesn’t want anyone to know about this album.  Rage Against The Machine is back! ‘What better place than here? What better time than now?’", "label": "Fake"},
	{ "text": "By Michael Hoult Some Evangelical Christians are beginning to hold presumed Republican presidential candidate Donald Trump in high esteem. Several Evangelicals, including walking gaffe former Rep. Michelle Bachmann, already believe Trump, the thrice married, casino magnate, who appeared on the cover of Playboy, has been ordained by God.  But televangelist Pat Robertson has taken it one step further. He believes Trump is on par with Jesus Christ.  “God came to me in a dream last night and showed me the future,” said Robertson. “He took me to heaven and I saw Donald Trump seated at the right hand of our Lord.”  According to Raw Story, Robert Jeffress, pastor of First Baptist Church in Dallas, a 12,000-member megachurch, said Trump would make a better candidate than Jesus.  “You know, I was debating an evangelical professor on NPR, and this professor said, ‘Pastor, don’t you want a candidate who embodies the teaching of Jesus and would govern this country according to the principles found in the Sermon on the Mount?’” said Jeffress. “I said, ‘Heck no.’ I would run from that candidate as far as possible, because the Sermon on the Mount was not given as a governing principle for this nation.”  “When I’m looking for somebody who’s going to deal with ISIS and exterminate ISIS, I don’t care about that candidate’s tone or vocabulary, I want the meanest, toughest, son of a you-know-what I can find — and I believe that’s biblical,” said Jeffress.  Sharing is caring!", "label": "Fake"},
	{ "text": "The famous drag queen, actor and recording artist Rupaul, claims that Donald Trump grabbed his ass and genitals during a party in 1995.  In an exclusive interview with the Hollywood Inquirer, Rupaul said that Mr Trump “made a move” on him during an event celebrating the release of the movie To Wong Foo, Thanks for Everything! Julie Newmar.  The artist was wearing his full drag queen apparel at the time, and he says Trump clearly mistook him for a real woman.  “I had just come out of the bathroom when Trump jumped on me and kissed me”, he explained. “He started grabbing my ass and pulled my dress up to grab my genitals. He suddenly became very angry. He started yelling and cursing, and he left the party.”   Rupaul says he was dressed “very sexy” for the party and is convinced that Trump thought he was a woman. Rupaul says he found Donald Trump attractive before this incident, but that he was shocked by his rudeness and vulgarity.  Rupaul told the Hollywood Inquirer that Donald Trump moved on him during a party, grabbing his ass and genitals. “He just wanted to use me as an object,” he told Hollywood Inquirer. “I’ve never felt so dirty in my life! In a way, I was saved by the fact that I’m a man.”  This allegation from Rupaul adds to the wave of accusations of inappropriate sexual behavior concerning Donald Trump.  Many women have come forward over the last week to denounce the abusive groping and sexual harassment they suffered from Trump over the years.  The New York Times published an article earlier this week, in which Trumps’s alleged victims described the mistreatment they suffered.  All these allegations came after Trump bragged about kissing, groping and trying to have sex with women who were not his wife on recordings from 2005 obtained by The Washington Post and NBC News.  The comments were part of a conversation with Billy Bush, then a host of the television show “Access Hollywood.”  The remarks were captured by a live microphone that Trump did not appear to know was recording their conversation.  “You know I’m automatically attracted to beautiful — I just start kissing them. It’s like a magnet. Just kiss. I don’t even wait,” Trump said. “And when you’re a star they let you do it. You can do anything.”  He added: “Grab them by the pussy. You can do anything.”  In Rupaul’s case, Trump seems to have been disappointed by what he discovered under the dress.", "label": "Fake"},
	{ "text": "A quiet burst of activity from the Sanders campaign seems to all but guarantee that Sanders will run as an independent this election cycle. All across the country Sanders’ core infrastructure of volunteers and paid staff are mobilizing to collect signatures and perform necessary paperwork to get him on the general election ballots in the states.  Officials highly placed within the Sanders campaign remain evasive and deny that the senator plans, at this time, to run as an independent. Sanders campaign manager, Jeff Weaver, has stated time and time again that they intend to go all the way to the convention and make the case that Sanders should be the Democratic nominee for the 2016 general election. But the Sanders campaign is actively engaging in activities, within the states, that have no other purpose besides putting Sanders in the position of being able to run as an independent candidate against Donald Trump and Hillary Clinton.  If Sanders were to run in the general election, as the evidence of his campaign’s actions point to, it could disastrously impact Democratic frontrunner Hillary Clinton’s ability to win against presumptive Republican nominee Donald Trump. With present polling showing Clinton ahead of Trump in the general election by only six points, even a small split of democratic democratic leaning independent voters would virtually guarantee a Trump victory and presidency. And with divisiveness and disunity within the Democratic party over policy direction and candidate choice at an all time high, polling experts say Sanders could syphon off as much as 20% of the democratic vote in a 3 candidate general election.  Many of Sanders supporters have been openly and vocally calling for the senator to run as an independent if he fails to secure the Democratic nomination. Citing unfair favouritism toward Clinton by the DNC under Debbie Wasserman Schultz, highly suspicious deviations between primary exit polling and election results, Sanders supporters have made the argument that the systematic corruption within the Democratic party will not allow progressive ideas and platforms to flourish if the party elite believe they can act with impunity and still count on the vote of progressives. It has been reported that Sanders is privately supportive of this type of analysis, and his coming independent candidacy will be engineered to force the party to the left, going forward, if they wish to compete against Republicans on a national level.  Sources within the Sanders campaign, speaking on conditions of anonymity, say that Sanders has indeed been seriously considering an independent run, and wishes to ensure the option is available to him by performing the necessary work now. If Sanders were to wait until after the convention to lay the legal foundation for an independent run it would be too late. It is this fact that explains the Sanders campaign’s actions toward inclusion on state ballots as an independent at this time.", "label": "Fake"},
	{ "text": "A week after Sarah Palin endorsed Donald Trump for president, the former Alaskan Governor is now endorsing Iowa Caucus winner, Ted Cruz.  Palin told the Alaskan Times, “After deep meditation while hunting me some moose, I decided Ted Cruz is the real man for the job. It’s hard for me to admit, since I’ve only been wrong once or twice in my life, but I have to do the right thing and put my support behind Ted.  ---- Scroll down to read more ---- “While he might be using tactics, I’m a dirty gal and know what it takes to win. I’m prouder than a duck dating a mongoose to support Ted Cruz.”  We’ll see who wins New Hampshire, though, since “there are a lot of primaries and caucuses left, and I want to pick the winner, so my endorsement will go how the political winds go. I could end up endorsing myself by the time this process is done.”  Trump called Palin an ‘Indian Giver’ after she changed her endorsement and gave it to rival Ted Cruz.  “Is her endorsement even worth anything?” Trump asked supporters at a New Hampshire rally. “First she doomed McCain; then she doomed me in Iowa. I think I’ll stay as far away from that nut job as possible and let Ted deal with the Palin curse. Let me tell you the truth, I didn’t know what the hell she was talking about most of the time. I don’t understand her appeal.”", "label": "Fake"},
	{ "text": "In a recent interview, former Alaska governor Sarah Palin commented that she isn’t ruling out the possibility of becoming a vice presidential candidate for Donald Trump. Still, she expressed concerns that her position on the campaign trail could do more harm than good.  When asked about the issue on CNN’s “State of the Union” on Sunday, Palin called herself a ‘realist’ and acknowledged that a run for office would bring a ton of controversy.  “Well, I want to help and not hurt, and I am such a realist that I realize there are a whole lot of people out there who would say ‘anybody but Palin,’” the former GOP vice presidential nominee commented.  “So, you know, I just – I just want the guy to win,” she added. “I want American to win. And I don’t know if I would be the person that would be able to help him win, Jake.”  Palin did point out, however, that Palin has already had her background investigated ruthlessly.  “I think I’m pretty much as vetted as anybody in the country,” Palin commented. “So, I think there are so many other great people out there in America who can serve in this position. I think if someone wanted to choose me, they already know who I am, what I stand for. They wouldn’t be in for any surprises.”  Palin would be a controversial pick, there is no doubt, but Trump could do a lot worse. She served John McCain well in his 2008 campaign for president.  Palin has an energy that could match Trump’s on the trail, and there is no question that she is a tried and true conservative.  What do you think of Palin? Would she make a good Vice President?", "label": "Fake"},
	{ "text": "Americans have trouble trusting the Clintons for many reasons, but near the top of the list is the infamous “Clinton kill list,” featuring the names of people close to Hillary and Bill that have died under mysterious circumstances.  Now, it appears that yet another name has been added to this list.  Former U.N. President John Ashe was reportedly found dead last Wednesday. Officials claim he died of a heart attack, but others suspect foul play. The Conservative Tribune reports that local police officers in Dobbs Ferry, New York argue that Ashe died from a workout accident that crushed his throat.  Ashe’s death became even more suspicious when police learned that he was scheduled to be in court Monday with Chinese businessman and co-defendant Ng Lap Seng. Ashe reportedly received $1 billion in donations from Seng during his term as president.  It was later revealed that Seng also illegally funneled several hundred thousand dollars to the Democrat National Committee during Bill’s presidency. An anonymous source told reporters that prosecutors planned to use this link to Ashe to convince him to testify against her.  “It would have been very embarrassing,” the source added. “His death was conveniently timed.”  Of course, conspiracy theorists believe that Ashe is just the latest victim of the Clintons. We wouldn’t put it past them to take down anyone who has damning information against them—and God only knows how long that list is.  What do you think? Do the Clintons belong behind bars and far, far away from the White House?", "label": "Fake"},
	{ "text": "Trump refuses to disavow the Dark Lord’s support, stirring controversy  MORDOR — Sauron, the fallen Maia best known for engulfing Middle-Earth in two apocalyptic wars, has endorsed real estate mogul and reality TV star Donald Trump for president of the United States. This comes as to shock to those who thought that Sauron was destroyed at the end of the Third Age.  Though Sauron’s power greatly diminished after the destruction of The One Ring, a fragment of his broken spirit has endured for millennia, and still lurks beneath the ruins of Barad-dûr (present-day Gadsden, Alabama). The Dark Lord is currently not powerful enough to assume a physical form, but still has the presence of mind to follow the Republican presidential primaries.  “Donald Trump is the only candidate who can fulfill my vision for the future,” Sauron said Saturday night in an omnipresent, ethereal whisper. “Just as I spread darkness and suffering across Middle-Earth, so shall Trump bring darkness to Middle America.”  In many ways, Trump is a natural choice for Sauron. During his tenure as the Dark Lord of Mordor, Sauron enacted or supported numerous controversial policies, including the expansion of torture, the murder of Rohirrim families, and the deportation of 12 million dwarves.  When asked about Sauron on NBC’s Meet the Press, Trump seemed hesitant to distance himself from the evil necromancer. “I don’t think the American people want me to dismiss every Dark Lord before I have a chance to learn more about them,” said Trump. “I just don’t know anything about Sauron or his dark legion of orcs, trolls, and Nazgûl; I need to do more research.”  Trump’s refusal to disavow Sauron’s support has sparked huge backlash from pundits and fellow presidential candidates, who claim that Trump is himself a lieutenant of the Dark Lord. The Republican frontrunner took to Twitter to refute this claim: “Definitely not a follower of Sauron. The palantír in Trump Tower lobby is for decoration only — not for communicating with dark lords!”", "label": "Fake"},
	{ "text": "A bombshell study released by Stanford University confirms evidence of election fraud during the 2016 Democratic Party primaries.   According to a paper released this week entitled, “Are we witnessing a dishonest election?,” a state comparison based on the voting procedures used during the election reveals endemic election fraud within the system.  Given the stakes in the outcome of the American presidential elections, ensuring the integrity of the electoral process is of the utmost importance.  Are the results we are witnessing in the 2016 primary elections trustworthy? While Donald Trump enjoyed a clear and early edge over his Republican rivals, the Democratic contest between former Secretary of State Hillary Clinton and Senator Bernard Sanders has been far more competitive.  At present, Secretary Clinton enjoys an apparent advantage over Sanders. Is this claimed advantage legitimate?  We contend that it is not, and suggest an explanation for the advantage: States that are at risk for election fraud in 2016 systematically and overwhelmingly favor Secretary Clinton. We provide converging evidence for this claim.  First, we show that it is possible to detect irregularities in the 2016 Democratic Primaries by comparing the states that have hard paper evidence of all the placed votes to states that do not have this hard paper evidence. Second, we compare the final results in 2016 to the discrepant exit polls.  Furthermore, we show that no such irregularities occurred in the 2008 competitive election cycle involving Secretary Clinton against President Obama.  As such, we find that in states wherein voting fraud has the highest potential to occur, systematic efforts may have taken place to provide Secretary Clinton with an exaggerated margin of support.", "label": "Fake"},
	{ "text": "Earlier tonight, Ted Cruz announced he was getting out of the race for the Republican Nomination. Cruz was defeated by Donald Trump through a particularly large margin. To this point, Ted Cruz had served as Donald Trump’s strictest competitor in the often contentious race.  Following the loss, Donald Trump commended Cruz for serving as his greatest competitor and said he was a smart guy. Immediately after Ted Cruz announced he was no longer running for president, he swiftly excited the facility where his press conference was held.  Approximately one hour after leaving the campaign site, Ted Cruz was spotted in a nearby store purchasing trash bags, bleach, and a shovel — fueling rampant speculation that he was none other than the Zodiac Killer getting back to his old ways.  While making the purchase, Cruz could be seen pacing back in forth mumbling the lyrics to “Mad World” by Gary Jules underneath his breath.  The Ted Cruz campaign has vehemently denied up to this point that Cruz could be the elusive Zodiac Killer but images released online seem to paint a very different picture.  When asked by the clerk what he was using the items for, Cruz said he was “getting back to work” and handed him a card with a mysterious symbol.", "label": "Fake"},
	{ "text": "PHILADELPHIA, Pennsylvania (The Adobo Chronicles, Washington Bureau) – Sources close to the Democratic National Committee (DNC) have confirmed to The Adobo Chronicles that the chosen theme for this year’s convention is “Vote Your Conscience.”  The theme reinforces the idea that it is “unconscionable” for any American to vote for Donald Trump.  And what better person to expound on this theme than former Republican presidential candidate Senator Ted Cruz.  Cruz emphasized this theme during his speech at the Republican National Convention in Cleveland earlier this week. He has been invited by DNC to speak just before Hillary Clinton delivers her nomination acceptance speech.  He has accepted.  Upon learning of the news, Trump accused Cruz of being a turncoat and a sore loser.  The senator from Texas refused to endorse Trump during his Cleveland speech, eliciting boos from the Republican crowd.  We caught up with Cruz on his way to Philadelphia and asked him if this meant he was voting for Clinton in November.  “I am still undecided, but I know that my wife Heidi Cruz will. In no way is she voting for a misogynist like Trump.”  During the Republican primaries, Trump and Cruz became engaged in a personal war of words, with Trump sharing an unflattering picture of Heidi on Twitter.", "label": "Fake"},
	{ "text": "DONALD J. Trump has told Fox and Friends that he believes the U.S. “should never have allowed” Canada to gain independence. The republican candidate for president freely admits to being “a little rusty” on Canadian history, but feels confident that the United States owned Canada “at some point”, and claims giving it back was a “major mistake”.  The former reality tv star was responding to a question about Puerto Rico possibly becoming the 51st of the United States, when he made the statement. “It used to be 51 you know, when we had Canada,” Trump said, pointing to an American flag, “Or 52 if you count Mexico which I never will, no matter how much they beg.”  The interviewer Brian Kilmeade, seemed unmoved by Trump’s remark and asked him to explain his understanding of Canadian American history, as the Fox host began scribbling notes:  “I personally think it was the biggest mistake in American history, giving Canada back. Look at that place now, it’s falling to pieces. It’s overrun by godless, gunless hippies and it’s such a shame to see.”  As the host nodded along, Trump explained that America got a “terrible deal” with Canada who “stole” the land over a thousand years ago “or something like that”.  “It was a truly awful deal. Canada gets Toronto and Vancouver, which has the hottest women, and what did we get? Alaska? The Florida of Canada? Such a terrible deal.”  Donald Trump Claims He Will Buy Canada if Clinton Gets Elected | Trump Canada Independence LATEST: Donald Trump Claims He Will Buy Canada if Clinton Gets Elected | Trump Canada Independence “Well what are you going to do if elected?” Kilmeade asked. “Forcefully take Canada and claim it as part of America?”  “I think that’s gotta be an option,” Trump responded. “You know, they’ve got a lot of oil up there, a lot.”  “I’m not sure there is any evidence to support this theory, Donald,” Kilmeade intervened. “I mean wasn’t Canada founded by Britain and France who invaded–” “No, are you kidding me?” Trump interrupted. “You think that either of those guys know the first thing about war? No Canada has belonged to America since Jesus’ time, and that’s a fact.”  Shortly after the controversial interview, Trump reiterated his stance towards Canada with a tweet that was deleted 20 minutes later, not before being retweeted over 6,000 times.  Trump make canada American again Trump Canada Independence Trump Canada Independence Should Canada become the 51st state of America? Join the debate on Facebook and Twitter…", "label": "Fake"},
	{ "text": "After protests erupted in Chicago that led to the cancellation of a Donald Trump rally at the University of Illinois-Chicago Pavilion, the controversial Republican candidate has filed a lawsuit against the city for prohibiting his First Amendment right to free speech.      “My free speech right was infringed last Friday in Chicago and that’s what it will say in the lawsuit,” Trump told reporters. “We’ll be asking for a monetary settlement and for those protestors to be prosecuted. It was very, very wrong of them. I do not condone violence. I’m very against violence, especially at my campaign events.”  Trump’s attorneys drew extensive papers on the lawsuit and are filled on Monday. A Chicago judge will review them by next week.  “Chicago violated my First Amendment right and they aren’t going to get away with it. Just like China won’t get away with stealing our jobs and manipulating their currency.”  The campaign thinks a conspiracy might be involved with the anti-trump protesters. “When the cops saw a bunch of black people entering my rally, they knew they shouldn’t be there but let them in anyway. I mean, what the Hell is that?”  Trump then went after Chicago’s Mayor Rahm Emanuel. “I know Rahm thinks he’s a tough guy, but he’ll be a mouse looking for his mom by the time I get done with him. He makes ‘Little Rubio’ look like a giant.  A New Yorker will beat a Chicagoan every time. Believe me, he is going to regret not having his city under control.  He was terrible as Obama’s Chief of Staff and he’s been a terrible Mayor. Look at the gang problem and the cities credit rating.  “I’m happy Nabisco closed that Chicago factory and moved it to Mexico. I was against it before, but after tonight, I’m totally for it.”  The Mayor    Chicago Mayor Rahm Emanuel1 called the lawsuit “frivolous” and “ridiculous.”  “You can’t have a presidential candidate going around suing cities because the local people don’t like the guy,” Emanuel told the Chicago Tribune. “The city is in massive debt and the last thing we need is to be tied up in court for years to come cause we know Trump loves to sue people. Legal fees aren’t cheap.”  Trump claimed the Chicago Police Department told him to call off the event but they responded by saying it was Trump’s campaign that called off the event and the Chicago Police did not infringe on his free speech right.  “If Trump thinks he can bully the City of Chicago, he’s got another thing coming.”", "label": "Fake"},
	{ "text": "Manhattan – Earlier this morning, Trump University issued degrees to 4,500 students online, and drew the attention of national media when the university announced several high-profile recipients of honorary degrees, sources say. Among those to receive honorary degrees, Sarah Palin was offered a honorary doctorate in climate science, a M.D. in advanced neurosurgery, and a PhD in “having total class”.   “We doctors are the shakers and the movers, the pokers and jokers, the wheelin’ and the stealin’, Obama’s been to that mountaintop, that I can tell you…” Palin told a crowd of the stupidest humans alive Saturday morning. “Let’s get that Trump Train behind us, in front of us, in our hearts, our minds, our mouths… Get the word of mouth out for Donald!”  Palin has been in the headlines this week after questioning whether or not Bill Nye, “The Science Guy” was in fact an actual scientist.   “Bill Nye is as much a scientist as I am,” Palin said at an event in Washington, D.C according to The Hill.  Palin targeted Nye over his statements on global warming featured in the anti-climate change documentary “Climate Hustle”.  Donald also reportedly offered “one hundred degrees from my university” to John Kasich for his delegates, but the Kasich Camp has not responded to our request for comment, and sources close to the governor say he may be holding out for Vice President.  With the announcment, Palin becomes the first minority to receive the prestigious degree without paying an exorbitant amount.", "label": "Fake"},
	{ "text": "WOW..  Donald Trump has sent the Internet into a frenzy again today by adding a new stipulation for people that come to see him speak at his campaign rally’s and it’s called the “Brown Paper Bag Test”  For those unfamiliar with the brown paper test, it’s where the skin tone of African-Americans were visually measured against an actual brown paper bag; individuals lighter than the bag were labeled with more positive attributes compared to dark skin males and females.  'The Brown Paper Bag Test' “The Brown Paper Bag Test” It gained popularity after the abolishment of slavery in 1865 and unconsciously, this test still seems to exists within the black community, especially when it comes to dating. Preference is natural in any aspect of life but within the black community bias stereotypes can fog decisions and lead to unhealthy relationships.  Now Donald Trump has decided to use this test at all future campaign rally’s and if you are not lighter than the brown paper bag you will not gain entry into any of his Pep Rally’s.  Trump released a statement saying:  “IT’S NOT ABOUT BLACK OR WHITE, IT’S ABOUT RICH AND POOR, CLASS AND NO CLASS, WHICH SIDE ARE YOU ON? I’M ON AMERICA’S SIDE AND I WILL MAKE HER GREAT AGAIN”", "label": "Fake"},
	{ "text": "Julian Assange, the founder of WikiLeaks, is a controversial character. But there’s no denying the emails he has picked up from inside the Democrat Party are real, and he’s willing to expose Hillary Clinton.  Now, he’s announcing that Hillary Clinton and her State Department were actively arming Islamic jihadists, which includes the Islamic State (ISIS) in Syria.  Clinton has repeatedly denied these claims, including during multiple statements while under oath in front of the United States Senate.  WikiLeaks is about to prove Hillary Clinton deserves to be arrested:  The Reagan administration officials hoped to secure the release of several U.S. hostages, and then take proceeds from the arms sales to Iran, to fund the Contras in Nicaragua. Sounds familiar?  In Obama’s second term, Secretary of State Hillary Clinton authorized the shipment of American-made arms to Qatar, a country beholden to the Muslim Brotherhood, and friendly to the Libyan rebels, in an effort to topple the Libyan Gaddafi government, and then ship those arms to Syria in order to fund Al Qaeda, and topple Assad in Syria.  Clinton took the lead role in organizing the so-called “Friends of Syria” (aka Al Qaeda ISIS) to back the CIA-led insurgency for regime change in Syria.  Under oath Hillary Clinton denied she knew about the weapons shipments during public testimony in early 2013 after the Benghazi terrorist attack.  In an interview with Democracy Now, Wikileaks’ Julian Assange is now stating that 1,700 emails contained in the Clinton cache directly connect Hillary to Libya to Syria, and directly to Al Qaeda and ISIS. Via The Duran  Here is the incredible transcript:  JUAN GONZÁLEZ: Julian, I want to mention something else. In March, you launched a searchable archive for over 30,000 emails and email attachments sent to and from Hillary Clinton’s private email server while she was secretary of state. The 50,547 pages of documents span the time from June 2010 to August 2014; 7,500 of the documents were sent by Hillary Clinton herself. The emails were made available in the form of thousands of PDFs by the U.S. State Department as the result of a Freedom of Information Act request. Why did you do this, and what’s the importance, from your perspective, of being able to create a searchable base? JULIAN ASSANGE: Well, WikiLeaks has become the rebel library of Alexandria. It is the single most significant collection of information that doesn’t exist elsewhere, in a searchable, accessible, citable form, about how modern institutions actually behave. And it’s gone on to set people free from prison, where documents have been used in their court cases; hold the CIA accountable for renditions programs; feed into election cycles, which have resulted in the termination of, in some case—or contributed to the termination of governments, in some cases, taken the heads of intelligence agencies, ministers of defense and so on. So, you know, our civilizations can only be as good as our knowledge of what our civilisation is. We can’t possibly hope to reform that which we do not understand.  So, those Hillary Clinton emails, they connect together with the cables that we have published of Hillary Clinton, creating a rich picture of how Hillary Clinton performs in office, but, more broadly, how the U.S. Department of State operates. So, for example, the disastrous, absolutely disastrous intervention in Libya, the destruction of the Gaddafi government, which led to the occupation of ISIS of large segments of that country, weapons flows going over to Syria, being pushed by Hillary Clinton, into jihadists within Syria, including ISIS, that’s there in those emails. There’s more than 1,700 emails in Hillary Clinton’s collection, that we have released, just about Libya alone.", "label": "Fake"},
	{ "text": "Election officials in Franklin County, Ohio are reportedly stumped over what one maintenance worker found in a dilapidated downtown Columbus warehouse earlier this week.  According to sources, Randall Prince, a Columbus-area electrical worker, was doing a routine check of his companies wiring and electrical systems when he stumbled across approximately one dozen black, sealed ballot boxes filled with thousands of Franklin County votes for Hillary Clinton and other Democrat candidates.  “No one really goes in this building.  It’s mainly used for short-term storage by a commercial plumber,” Prince said.  So when Prince, who is a Trump supporter, saw several black boxes in an otherwise empty room, he went to investigate.  What he found could allegedly be evidence of a massive operation designed to deliver Clinton the crucial swing state.  Early voting does not begin in Ohio until October 12, so no votes have officially been castin the Buckeye state.  However, inside these boxes were, what one source described as, “potentially tens of thousands of votes” for Hillary Clinton.  Christian Times Newspaper has not yet been able to obtain a photocopy of one of the ballots found inside the box, but an affiliate in Ohio passed along a replica of what was found.", "label": "Fake"},
	{ "text": "The suspicious circumstances surrounding the death last week of former U.N. President John Ashe had many wondering whether foul play was involved.  The New York Post’s Page Six reported that after Ashe was found dead Wednesday, the U.N. claimed that he had died from a heart attack. Local police officers in Dobbs Ferry, New York, later disputed that claim, saying instead that he died from a workout accident that crushed his throat.  Adding to the mysterious nature of Ashe’s death was the fact that he had been slated to be in court Monday with his Chinese businessman co-defendant Ng Lap Seng, from whom he reportedly received over $1 billion in donations during his term as president of the U.N. General Assembly.  According to an unidentified source who spoke with Page Six, prosecutors had intended to use the latter fact to link Ashe directly to Democrat front-runner Hillary Clinton, with whom he could be seen schmoozing in the picture above.  “It would have been very embarrassing,” the source added. “His death was conveniently timed.”  There was no evidence at the moment to corroborate the source’s theory of foul play, but that certainly did not stop conspiracy theorists from theorizing about “what really happened.”  Those theorists inclined to believe the stories about Hillary and Bill Clinton ordering the murders of their opponents wondered whether the former U.N. president was merely their latest victim  However, Ashe’s own lawyer, Jeremy Schneider, strongly disagreed with these theories.  TRENDING STORIES  Trump Ditches Media, Walks Into Restaurant… Tells Diners He’s Lowering Their Taxes, Gets Explosive Applause SHOCK: Insider Reveals Bill Blames Hillary for Loss… Media Dumbfounded Insider Reveals Hillary Got So Violent After Losing Extreme Measures Had to Be Taken “There is not one iota of evidence that it was homicide,” he reportedly said. “This is nothing at all like Vince Foster.”  The late Vince Foster was a deputy White House counsel who died by gunshot in 1993 after he allegedly committed suicide. Conspiracy theorists have maintained for years that his death was in fact a murder — one spearheaded by Hillary Rodham Clinton.  No definitive evidence was ever procured to prove this theory, but that didn’t stop them then, and it likely won’t stop them now.  H T RedFlag News  Please share this story on Facebook and Twitter and let us know what you think about this official’s death and whether or not you believe any of the conspiracy theories surrounding it!  Do you believe any of these conspiracy theories? Scroll down to comment below!", "label": "Fake"},
	{ "text": "Ottawa | Prime Minister Justin Trudeau is getting prepared to accommodate nearly 250,000 American refugees if Donald Trump is to be elected US president in November.  The Prime Minister was keen to stress the possibility of a mass exodus of American citizens on Canadian soil in case the controversial Republican candidate for the US presidency wins his presidential election.  “ In the event of a mass exodus of American citizens, Canada will always be a hospitable country for people persecuted or fleeing difficult living conditions ”  – Justin Trudeau, Prime Minister of Canada  “We reach out to refugees of all countries living under dictatorships and persecution,” he reiterated during a press conference this morning.  immigration Immigration Minister, the Honorable John McCallum, expects up to 1,000,000 American refugees by 2017 if Donald Trump is elected president Immigration requests exploding  Immigration Canada claims to have received more than 350,000 requests for information on Canadian citizenship status since Super Tuesday when Donald Trump won several important states.  “The more Trump advances, the more we are overwhelmed,” assures spokesperson for Immigration Canada, Amanda Singh. “Our whole 2016 budget is already gone since it was necessary to enroll extra workforce to successfully process all applications and even then, it is far from sufficient for the task” she admits, visibly under stress. “But Ottawa has promised us its full cooperation on this question,” she assured.  Miley Cyrus ready to leave the country  Several celebrities including Miley Cyrus, Macaulay Culkin and Nicolas Cage have threatened to leave the country in case of a victory by Donald Trump.  “If Trump is elected, it makes me sad, but I have no choice,” commented Miley Cyrus to the Rolling Stones magazine this week.  “I could never live under a president like him, it would be like living under the Soviet dictatorship of Hitler,” she explained.  According to information confirmed by the Hollywood Inquirer this week, a number of celebrities such as Miley Cyrus and Kanye West have shown interest in purchasing houses in the Toronto area and have already contacted real estate agents in the region.", "label": "Fake"},
	{ "text": "Khizr Khan, the Muslim Gold Star father that the mainstream media and former Secretary of State Hillary Clinton have been using to criticize Donald J. Trump, has deep ties to the government of Saudi Arabia—and to international Islamist investors through his own law firm. In addition to those ties to the wealthy Islamist nation, Khan also has ties to controversial immigration programs that wealthy foreigners can use to essentially buy their way into the United States—and has deep ties to the “Clinton Cash” narrative through the Clinton Foundation. Khan and his wife Ghazala Khan both appeared on stage at the Democratic National Convention to attack, on Democratic presidential nominee Hillary Clinton’s behalf, Donald Trump—the Republican nominee for president. Their son, U.S. Army Captain Humayun Khan, was killed in Iraq in 2004. Khizr Khan, in his speech to the DNC, lambasted Donald Trump for wanting to temporarily halt Islamic migration to America from countries with a proven history of exporting terrorists.  Since then, Clinton operative George Stephanopoulos—who served as a senior adviser to the president in Bill Clinton’s White House and is a Clinton Foundation donor as well as a host on the ABC network—pushed Trump on the matter in an interview. Trump’s comments in that interview have sparked the same mini-rebellion inside his party, in the media and across the aisle that has happened many times before. The usual suspects inside the GOP, from former Florida Gov. Jeb Bush to Sen. Lindsey Graham (R-SC) to House Speaker Paul Ryan to Senate Majority Leader Mitch McConnell to Ohio Gov. John Kasich, have condemned Trump in one way or another. The media condemnation has been swift and Democrats, as well their friends throughout media, are driving the train as fast as they can.  But until now, it looked like the Khans were just Gold Star parents who the big bad Donald Trump attacked. It turns out, however, in addition to being Gold Star parents, the Khans are financially and legally tied deeply to the industry of Muslim migration–and to the government of Saudi Arabia and to the Clintons themselves.  Khan, according to Intelius as also reported by Walid Shoebat, used to work at the law firm Hogan Lovells, LLP, a major D.C. law firm that has been on retainer as the law firm representing the government of Saudi Arabia in the United States for years. Citing federal government disclosure forms, the Washington Free Beacon reported the connection between Saudi Arabia and Hogan Lovells a couple weeks ago.  “Hogan Lovells LLP, another U.S. firm hired by the Saudis, is registered to work for the Royal Embassy of Saudi Arabia through 2016, disclosures show,” Joe Schoffstall of the Free Beacon reported.  The federal form filed with the Department of Justice is a requirement under the Foreign Agents Registration Act of 1938, which makes lobbyists and lawyers working on behalf of foreign governments and other agents from abroad with interests in the United States register with the federal government.  The government of Saudi Arabia, of course, has donated heavily to the Clinton Foundation.  “The Kingdom of Saudi Arabia has given between $10 and $25 million to the foundation while Friends of Saudi Arabia has contributed between $1 and $5 million,” Schoffstall wrote.  Trump, of course, has called on Hillary Clinton to have the Clinton Foundation return the money.  “Saudi Arabia and many of the countries that gave vast amounts of money to the Clinton Foundation want women as slaves and to kill gays,” Trump wrote in a Facebook post back in June, according to Politico. “Hillary must return all money from such countries!”  “Crooked Hillary says we must call on Saudi Arabia and other countries to stop funding hate,” Trump posted in a separate Facebook posting at the time. “I am calling on her to immediately return the $25 million plus she got from them for the Clinton Foundation!”  Of course, to this day, Hillary Clinton and her Clinton Foundation has kept the money from the Saudi Arabian government.  Schoffstall’s piece in the Washington Free Beacon also notes how Hogan Lovells lobbyist Robert Kyle, per Federal Election Commission (FEC) records, has bundled more than $50,000 in donations for Clinton’s campaign this year.  Khan’s connections with the Hogan Lovells firm run deep, according to a report from Law.com written by Katelyn Polantz.  “Many lawyers at Hogan Lovells remember the week in 2004 when U.S. Army Capt. Humayun Khan lost his life to a suicide bomber,” Polantz wrote. “Then-Hogan & Hartson attorneys mourned the death because the soldier’s father, Khizr Khan, a Muslim American immigrant, was among their beloved colleagues.”  Polantz wrote that Khan worked at the mega-D.C. law firm for years.  “Khan spent seven years, from 2000 to 2007, in the Washington, D.C., office of then-Hogan & Hartson,” Polantz wrote. “He served as the firm’s manager of litigation technology. Although he did not practice law while at Hogan, Khan was well versed in understanding the American courts system. On Thursday night, he described his late son dreaming of becoming a military lawyer.”  But representing the Clinton Foundation backing Saudi Arabian government and having one of its lobbyists bundle $50,000-plus for Clinton’s campaign are hardly the only places where the Khan-connected Hogan Lovells D.C. mega-firm brush elbows with Clinton Cash.   The firm also handles Hillary Clinton’s taxes and is deeply connected with the email scandal whereby when she was Secretary of State, Hillary Clinton set up a home-brew email server system that jeopardized classified information handling and was “extremely careless” according to FBI director James Comey.  “A lawyer at Hogan & Hartson [Howard Topaz] has been Bill and Hillary Clinton’s go-to guy for tax advice since 2004, according to documents released Friday by Hillary Clinton’s campaign,” The American Lawyer’s Nate Raymond wrote in 2008, as Hillary Clinton ran for president that year. “The Clintons’ tax returns for 2000-07 show combined earnings of $109 million, on which they paid $33 million in taxes. New York-based tax partner Howard Topaz has a broad tax practice, and also regularly advises corporations on M&A and executive compensation.”  Breitbart News’ Patrick Howley, in a deep investigative piece on Hillary Clinton’s email scandal, late last year uncovered how Topaz’s firm—which employed Khan while Topaz did Hillary Clinton’s taxes—is also connected to the email scandal.  “Topaz was a partner at Hogan & Hartson, which later merged to become known as Hogan Lovells, where Topaz continues to practice. The firm’s lawyers were major donors to Hillary Clinton’s first presidential campaign,” Howley wrote.  For her private email system, Clinton used a spam filtering program MX Logic.  “Hogan & Hartson handled the patent for MX Logic’s email-filtering program, which McAfee bought the small company for $140 million in 2009 in order to acquire,” Howley wrote. “The MX Logic company’s application for a trademark for its SPAMTRAQ program was filed in 2004 on Hogan & Hartson stationery and signed by a Hogan & Hartson attorney. Hogan & Hartson has been responsible for MX Logic annual reports. The email company’s Clinton links present more evidence that Clinton’s political and legal establishment was monitoring her private email use.”  If that all isn’t enough, that same Hogan & Hartson law firm—now Hogan Lovells—employed Loretta Lynch, the current Attorney General of the United States. Lynch infamously just a few weeks ago met with Bill Clinton, Hillary’s husband and the former president, on her private jet in Phoenix just before clearing Hillary Clinton of any wrongdoing when it came to her illicit private email server system.  Khan’s own website for his own personal law firm KM Khan Law Office shows he represents clients in the business of buying visas to enter the United States. One of his specific areas of practice, according to the website, is “E2 Treaty Investors, EB5 Investments & Related Immigration Services.”  Sen. Chuck Grassley, the chairman of the U.S. Senate’s Judiciary Committee, has detailed how the EB5 immigration program is “riddled with flaws and corruption.”  “Maybe it is only here on Capitol Hill—on this island surrounded by reality—that we can choose to plug our ears and refuse to listen to commonly accepted facts,” Grassley said in a statement earlier this year. “The Government Accountability Office, the media, industry experts, members of congress, and federal agency officials, have concurred that the program is a serious problem with serious vulnerabilities. Allow me to mention a few of the flaws.”  From there, Sen. Grassley listed out several of the “flaws” with the EB5 immigration program that Khan works in:  – Investments can be spent before business plans are approved.   – Regional Center operators can charge exorbitant fees of foreign nationals in addition to their required investments.    – Jobs created are not “direct” or verifiable jobs but rather are “indirect” and based on estimates and economic modeling.  – Jobs created by U.S. investors are counted by the foreign national when obtaining a green card, even if EB-5 money is only a fraction of the total invested.  – Investment funds are not adequately vetted.   – Gifts and loans are acceptable sources of funds from foreign nationals.  – The investment level has been stagnant for nearly 25 years.  – There’s no prohibition against foreign governments owning or operating regional centers or projects.  – Regional centers can be rented or sold without government oversight or approval.  – Regional centers don’t have to certify that they comply with securities laws.    – There’s no oversight of promoters who work overseas for the regional centers.  – There’s no set of sanctions for violations, no recourse for bad actors.  – There are no required background checks on anyone associated with a regional center.  – Regional centers draw Targeted Employment Area boundaries around poor areas in order to come in at a lower investment level, yet the jobs created are not actually created in those areas.  – Every Targeted Employment Area designation is rubberstamped by the agency.  – Adjudicators are pressured to get to a yes, especially for those politically connected.   – Visas are not properly scrutinized.   – Visas are pushed through despite security warnings.  – Files and applications lack basic and necessary information to monitor compliance.  – The agency does not do site visits for each and every project.  – There’s no transparency on how funds are spent, who is paid, and what investors are told about the projects they invest in.  That’s not to mention the fact that, according to Sen. Grassley, there have been serious national security violations in connection with the EB5 program that Khan works in and around already. In fact, the program—according to Grassley—was used by Middle Eastern operatives from Iran to attempt to illicitly enter the United States.  “There are also classified reports that detail the national security, fraud and abuse. Our committee has received numerous briefings and classified documents to show this side of the story,” Grassley said in the early February 2016 statement. “The enforcement arm of the Department of Homeland Security wrote an internal memo that raises significant concerns about the program. One section of the memo outlines concerns that it could be used by Iranian operatives to infiltrate the United States. The memo identifies seven main areas of program vulnerability, including the export of sensitive technology, economic espionage, use by foreign government agents and terrorists, investment fraud, illicit finance and money laundering.”  Maybe all of this is why–as Breitbart News has previously noted–the Democratic National Convention made absolutely no mention of the Clinton Foundation or Clinton Global Initiative. Hillary Clinton’s coronation ceremony spent exactly zero minutes of the four nights of official DNC programming talking about anything to do with perhaps one of the biggest parts of her biography. ", "label": "Fake"},
	{ "text": "Authors Darwin Porter and Danforth Prince have released a bombshell report about former President Bill Clinton that could end Hillary’s campaign!  In their new book, Bill & Hillary: So This is That Thing Called Love, the authors interview Clinton insiders who claim that Bill slept with so many women that Hillary Clinton has repeatedly forced him to get an HIV test from the doctor. This is because the former President “favored unprotected sex.”  And while the first tests came back negative, HIV and AIDS might explain an ongoing mystery. Over the years, both Clintons have kept their medical records a secret. Clinton has explained his rapidly changing appearance to his heart surgery and “new diet” but he has looked increasingly thin and weak at Hillary campaign rallies.  As Rush Limbaugh opined, looking at Bill Clinton on the campaign trail,  Rush only sees Preparation H, Geritol, Fixodent, and Depends. Bill Clinton looks like his health is on a rapid recline.  Bill Clinton is roughly the same age as President George W. Bush. But while Bush looks healthy, Clinton only becomes older and frail.  Even a former Clinton White House advisor admits Bill looks unhealthy and “washed-up”:  Former Bill Clinton advisor and television personality Dick Morris thinks his old boss isn’t looking too good these days. “I didn’t recognize the character that was on TV,” Morris said of Bill Clinton’s recent interview with NBC News in a video released Monday. “He was washed-out, he was listless, he was apathetic, he was very slow-talking and even slower thinking!” hillary clinton hiv  Here is a picture of Clinton recently appearing on CNN with an unexplained lesion on his forehead. Very strange: ", "label": "Fake"},
	{ "text": "Indianapolis, IN — Some are calling Donald Trump’s recent revelation a low blow and dirty politics. Some are calling it fair play in a very dirty game. This morning via Twitter as promised, Donald Trump spilled the beans about his opponent, Lyin’ Ted Cruz’ wife, Heidi. In a Skype interview with Donald Trump this morning, The Scooper was able to get some clarification in this new aspect of the Trump, Cruz feud.  “Lyin’ Ted Cruz is married to a former call girl. It’s terrible. So terrible,” stated the Donald. “I mean, Lyin’ Ted Cruz thinks that Americans want a call girl in the White House? It’s terrible. Just terrible,” rambled Mr. Trump.  When asked how he came to be in possession of this information, Mr. Trump responded, “It’s terrible. I didn’t want to have to spill the beans. But I warned him (Cruz) not to go down this path. I warned him. It’s terrible. He put out an attack ad about my wife. It’s terrible, terrible. I warned him. But, he wants to play dirty. I know about a lot of skeletons in GOP closets. It’s terrible. That is why the GOP is so very, very afraid of me. They know that I know, and they know that I will say what I know if I have to say what I know. You know? It’s terrible. Just horrible.”  When asked why he thought this was terrible, the Scooper asked a follow-up question.  “How do you know, and is your assertion that Heidi Cruz is a former call girl the truth?”  “Well, I have been in the same room with her when she has committed these terrible, terrible acts. I have pictures! I have video!” exclaimed The Donald. “She is sitting there, dialing the phone. One poor person after another having to endure unsolicited calls from this girl. She wouldn’t stop. She called, and called, and called. It’s terrible. Horrible. And the things she says to these poor voters. Horrible.”  At this point, some woman with a lazy eye came into frame, screamed, and our connection went dead.", "label": "Fake"}
]